{
  "main": {
    "name": "Ryan Lambert",
    "occupation": "Software Engineer",
    "description": "",
    "image": "profile.png",
    "bio": "I was introduced to computers by my parents at a young age. Playing games on 8-inch floppy disks eventually turned into building gaming PCs. Inevitably, I attended college for computer technology where I learned about computer networking and server administration. After a four years of working in IT support and infrastructure I came to appreciate the power of programming. This appreciation led me to return to school in pursuit of a computer science degree. I finalized my computer science degree with capstone where I wrote a DLL injector and a handful of PC game hacks, spawning my interest in cybersecurity. I am simultaneously working full-time as a software engineer and pursuing a master's degree where I continue my passion for learning about all things software, cybersecurity, and malware related.",
    "contactmessage": "Here is where you should write your message to readers to have them get in contact with you.",
    "email": "youremailhere@gmail.com",
    "phone": "555-555-5555",
    "address": {
      "street": "(Your Street)",
      "city": "(Your City)",
      "state": "(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "",
    "resumedownload": "resume.pdf",
    "featureArticle": "https://eecs.oregonstate.edu/never-stop",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/john-ryan-lambert/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/rylamb",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Here you can create a short write-up of your skills to show off to employers",
    "education": [
      {
        "school": "Georgia Institute of Technology",
        "degree": "M.S. in Computer Science",
        "graduated": "August 2020 - Present",
        "description": "● Intro to Operating Systems (CS6200) - Basic operating system support for concurrency and synchronization, resource management, and distributed services involving the use of multithreading (pthreads), inter-process communication (shared memory and message passing using POSIX/SysV), and distributed interactions via RPC (gRPC).\n● Advanced Topics in Malware Analysis (CS6747) - Manual and automated static and dynamic techniques to analyze data dependence and control flow of real-world APT malware.\n● Binary Exploitation Lab (CS6265) - Application of exploitation techniques involving shellcoding, bypassing security measures (NX/DEP/PIE/ASLR/Canaries), format vulnerabilities, return-oriented programming (ROP), and heap vulnerabilities in the format of a semester long Capture-The-Flag (CTF)."
      },
      {
        "school": "Oregon State University",
        "degree": "B.S. in Computer Science",
        "graduated": "Awarded: June 2020",
        "description": ""
      },
      {
        "school": "Ball State University",
        "degree": "B.S. in Computer Technology",
        "graduated": "Awarded: May 2014",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "Workiva",
        "title": "Software Engineer",
        "years": "May 2021 - Present",
        "description": "● Created a load testing platform using Python (Locust) to isolate application performance bottlenecks at scale.\n● Improved observability by implementing New Relic monitoring on DynamoDB and Java Flight Recorder metrics.\n● Developed document processing automation software including backend APIs and email notification services using Python, Java Spring, AWS, and a variation of Apache Thrift."
      },
      {
        "company": "Principal Financial Group",
        "title": "Software Engineer",
        "years": "June 2020 - May 2021",
        "description": "● Developed insurance claim processing systems in AWS using TypeScript in support of PFML benefits.\n● Presented proof-of-concept implementations for HashiCorp Vault AppRole authentication.\n● Maintained automated certificate renewal processes using Python and Bamboo."
      },
      {
        "company": "",
        "title": "Software Engineer Intern",
        "years": "May 2019 - August 2019",
        "description": "● Automated BitBucket repository cleanup processes using Java and Jenkins.\n● Constructed Docker deployment pipeline using continuous integration and release tools.\n● 3rd place in 2019 Intern Code Jam: Created Google Cloud Platform hosted web app to manage university recruitment events, and interfaced with Google Maps API to serve event location data."
      },
      {
        "company": "Genesys",
        "title": "Application Engineer",
        "years": "December 2015 - May 2018",
        "description": "● Overhauled infrastructure processes resulting in expense savings of ~$1 million dollars leveraging PowerShell automation.\n● Conducted IT infrastructure administration in accordance with ITIL practices and served on the change management advisory board."
      },
      {
        "company": "",
        "title": "Senior System Engineer",
        "years": "May 2015 - December 2015",
        "description": "● Provided on-site consulting services and troubleshooting for premise customers.\n● Reformed existing technical documentation and assisted with Knowledge Base article creation.\n● Voluntarily assisted other support skill teams to reduce incident backlog, reduce Time-To-Resolution, and improve customer satisfaction."
      },
      {
        "company": "",
        "title": "System Engineer",
        "years": "May 2014 - May 2015",
        "description": "● Presented webinars and live presentations with attendance of 100+ customers.\n● Managed a team of engineers assigned to auditing PureConnect environments and consulted on best-practice reformations.\n● Provided in-depth root cause analysis of Windows server performance following critical failures.\n● Designed and led group and 1-on-1 training sessions for new employees.\n● Provided in-depth debugging and bug reports to software developers."
      }
    ],
    "skills": [
      {
        "name": "Git",
        "level": "60%"
      },
      {
        "name": "Illustrator",
        "level": "55%"
      },
      {
        "name": "ReactJs",
        "level": "50%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "HTML5",
        "level": "80%"
      },
      {
        "name": "VueJs",
        "level": "50%"
      },
      {
        "name": "MongoDB",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "CTF Writeups",
        "category": "Collection of CTF and challenge writeups",
        "image": "ctf-icon(2).png",
        "url": "https://github.com/rylamb/CTF_Writeups"
      },
      {
        "title": "Assault Cube Hacks",
        "category": "Internal DLL injection",
        "image": "assaultcube-screenshot.png",
        "url": "https://github.com/rylamb/Assault-Cube-Cheat-Library"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "I had the extreme pleasure of working with John during his time as a System Engineer at Interactive Intelligence / Genesys. John is a highly intelligent, curious, and passionate engineer. He was always willing to put in the effort to truly understand the technologies that he's working with, and even going as far as earning additional college degrees to dedicate himself into his software development career path. If you spend any time talking with John you'll discover just how much knowledge he has to bring to your organization.",
        "user": "Braden Pitts - Director, Splunk Services Deliver at Kinney Group, Inc."
      }
    ]
  }
}
